//
//  Header.h
//  voca2
//
//  Created by BATORGIL on 2024/02/27.
//

#ifndef Header_h
#define Header_h
README
星裕人へ：

アラートメッセージが出ているのをアプリが動いている限り基本無視していい

gitを使えば前の歴史が見えるので役立つかもしらない

基本的には勝手に機能を増やせばいいと思うけど俺の未完成だったところは以下：

    アラートメッセージが出ているのをアプリが動いている限り基本無視していい
    スキャン中にスキャン音を変えると対応できてない「Androidはそうなっている」
    設定画面のパネル中でデータというボタンを押すとファイルの種類によって変わる「コメントにしているので少しで完成できると思う」
    Macのテスト環境では読み上げ機能はおかしくなることがあるのでiPadでテストすればいいと思う「多分Appleのバグ」

来年度卒業研究がんばってね！

絶望的だったらメールしても構わない
ganbatbatorgil@gmail.com
#endif /* Header_h */
